tap "cncf/landscape2"
tap "coder/coder"
tap "hashicorp/tap"
tap "homebrew/core"
tap "kcl-lang/tap"
tap "pulumi/tap"
tap "siderolabs/tap"
brew "bat"
brew "cocoapods"
brew "docker-credential-helper"
brew "fastlane"
brew "git-lfs"
brew "kubecolor"
brew "okteto"
brew "qemu"
brew "telnet"
brew "testdisk"
brew "zsh"
brew "cncf/landscape2/landscape2"
brew "kcl-lang/tap/kcl-lsp"
cask "alt-tab"
cask "android-platform-tools"
cask "android-studio"
cask "coder/coder/coder-desktop"
cask "container"
cask "copilot-cli"
cask "darktable"
cask "dbschema"
cask "discord"
cask "displaylink"
cask "drawio"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "headlamp"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "pgadmin4"
cask "raycast"
cask "slack"
cask "visual-studio-code"
vscode "astral-sh.ty"
vscode "bierner.markdown-mermaid"
vscode "builder.builder"
vscode "charliermarsh.ruff"
vscode "coder.coder-remote"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "figma.figma-vscode-extension"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "heaths.vscode-guid"
vscode "hediet.vscode-drawio"
vscode "iliazeus.vscode-ansi"
vscode "jetpack-io.devbox"
vscode "kcl.kcl-vscode-extension"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vsliveshare.vsliveshare"
vscode "nefrob.vscode-just-syntax"
vscode "okteto.kubernetes-context"
vscode "okteto.remote-kubernetes"
vscode "opentofu.vscode-opentofu"
vscode "redhat.vscode-yaml"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vue.volar"
vscode "webnative.webnative"
vscode "yzhang.markdown-all-in-one"
